Repository: ljw27454788/confullweb
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, fr, ja, ko, ru, zh_hant

source: Box Header Connector | 2.54mm/2.0mm/1.27mm Pitch | Confull
es: Conector Box Header | Paso 2.54mm/2.0mm/1.27mm | Confull Electrónica
fr: Connecteur Box Header | Pas 2.54mm/2.0mm/1.27mm | Confull
ja: Box Headerコネクタ | ピッチ2.54mm/2.0mm/1.27mm | Confull エレクトロニクス
ko: Box Header 커넥터 | 피치 2.54mm/2.0mm/1.27mm | Confull 일렉트로닉스
ru: Разъём Box Header | Шаг 2.54мм/2.0мм/1.27мм | Confull
zh_hant: 簡牛 Box Header 連接器 | 多間距選項 | 超越世紀電子(Confull Electronics)

source: High-quality Box Header connectors with 2.54mm, 2.0mm, and 1.27mm pitch. Ideal for PCB connection. Explore Confull Electronics solutions now.
es: Conectores Box Header de alta calidad con pasos de 2.54mm, 2.0mm y 1.27mm. Perfectos para conexiones PCB. Conozca Confull Electrónica.
fr: Connecteurs Box Header de haute qualité avec pas de 2.54mm, 2.0mm et 1.27mm. Idéal pour les connexions PCB. Découvrez Confull Électronique.
ja: 2.54mm、2.0mm、1.27mmピッチ対応の高品質Box Headerコネクタ。基板接続に最適。Confull エレクトロニクスの製品を今すぐご覧ください。
ko: 2.54mm, 2.0mm, 1.27mm 피치의 고품질 Box Header 커넥터를 제공합니다. PCB 연결에 적합한 솔루션. 지금 Confull 일렉트로닉스를 확인하세요.
ru: Надёжные разъёмы Box Header с шагом 2.54мм, 2.0мм и 1.27мм. Идеальны для соединений на плате. Узнайте больше о продукции Confull Электроникс.
zh_hant: 提供2.54mm、2.0mm、1.27mm等多種間距的簡牛 Box Header 連接器，適用於各類 PCB 電子連接需求。瞭解超越世紀電子(Confull Electronics)的產品方案。

source: Confull Electronics
es: Confull Electrónica
fr: Confull Électronique
ja: Confull エレクトロニクス
ko: Confull 일렉트로닉스
ru: Confull Электроникс
zh_hant: 超越世紀電子 (Confull Electronics)

source: box header connector, 2.54mm pitch, PCB connector, square pin header, Confull
es: conector box header, paso 2.54mm, conector PCB, Confull
fr: connecteur box header, pas 2.54mm, connecteur PCB, Confull
ja: box header コネクタ, 2.54mmピッチ, PCB用コネクタ, Confull
ko: box header 커넥터, 2.54mm 피치, PCB 커넥터, Confull
ru: разъём box header, шаг 2.54мм, разъёмы для плат, Confull
zh_hant: 簡牛連接器, Box Header, PCB連接器, 2.54mm間距, Confull

source: Home
es: Inicio
fr: Accueil
ja: ホーム
ko: 홈
ru: Главная
zh_hant: 首頁

source: Box Header
es: Conector Box Header
fr: Connecteur Box Header
ja: Box Headerコネクタ
ko: Box Header 커넥터
ru: Разъём Box Header
zh_hant: 簡牛連接器

source: Product List
es: Lista de productos
fr: Liste des produits
ja: 製品一覧
ko: 제품 목록
ru: Каталог продукции
zh_hant: 產品目錄

source: Pitch
es: Paso
fr: Pas
ja: ピッチ
ko: 피치
ru: Шаг
zh_hant: 間距

source: Type
es: Tipo
ja: タイプ
ko: 타입
ru: Тип
zh_hant: 類型

source: Edge Card Connector | PCIe/Bus Gold Finger Slot | Confull
es: Conector Edge Card | Ranura PCIe / Bus | Confull
fr: Connecteur Edge Card | Fente PCIe / Bus | Confull
ja: Edge Cardコネクタ | PCIe/バス用スロット | Confull
ko: Edge Card 커넥터 | PCIe / 버스 슬롯 | Confull
ru: Разъём Edge Card | Слот PCIe / Шина | Confull
zh_hant: 總線金手指插卡連接器 | EDGE Card 插槽 | 超越世紀電子(Confull Electronics)

source: High-performance Edge Card Connectors for PCIe, gold finger, and bus slot applications. Discover durable solutions at Confull.
es: Conectores Edge Card de alto rendimiento para ranuras PCIe, conexiones de bus y contactos tipo “gold finger”. Descubra Confull Electrónica.
fr: Connecteurs Edge Card fiables pour fentes PCIe, bus et doigts dorés. Solutions robustes proposées par Confull Électronique.
ja: PCIeやバス用途に対応した高信頼性のEdge Cardコネクタ。金メッキエッジ接続に最適。Confull エレクトロニクスの製品をご覧ください。
ko: PCIe, 버스 및 골드 핑거 슬롯에 적합한 고성능 Edge Card 커넥터 제공. Confull 일렉트로닉스의 솔루션을 만나보세요.
ru: Надёжные Edge Card разъёмы для шины, PCIe и соединений типа Gold Finger. Откройте решения от Confull Электроникс.
zh_hant: 提供高性能EDGE Card總線插卡連接器，適用於金手指、PCIe、主機板插槽等應用。了解超越世紀電子(Confull Electronics)的連接解決方案。

source: edge card connector, gold finger connector, PCIe slot, bus connector, Confull
es: conector edge card, ranura PCIe, conector de bus, gold finger, Confull Electrónica
fr: connecteur edge card, fente PCIe, connecteur bus, doigt doré, Confull Électronique
ja: edge card コネクタ, PCIe スロット, バスコネクタ, gold finger, Confull エレクトロニクス
ko: edge card 커넥터, PCIe 슬롯, 버스 커넥터, gold finger, Confull 일렉트로닉스
ru: разъём edge card, слот PCIe, шина, gold finger, Confull Электроникс
zh_hant: 金手指連接器, EDGE Card, 插卡連接器, 總線插槽, Confull

source: EDGE Card Connector
es: Conector Edge Card
fr: Connecteur Edge Card
ja: Edge Cardコネクタ
ko: Edge Card 커넥터
ru: Разъём Edge Card
zh_hant: 總線金手指EDGE插卡連接器

source: Ejector Header Connector | 2.54/2.0/1.27mm | Confull
es: Conector tipo Ejector | Paso 2.54/2.0/1.27mm | Confull
fr: Connecteur à éjection | Pas 2.54/2.0/1.27mm | Confull
ja: イジェクターヘッダー | 2.54/2.0/1.27mm ピッチ | Confull
ko: 이젝터 헤더 커넥터 | 2.54/2.0/1.27mm 피치 | Confull
ru: Разъём с фиксацией | Шаг 2.54/2.0/1.27мм | Confull
zh_hant: 牛角連接器 | 2.54/2.0/1.27mm 間距 | 超越世紀電子(Confull Electronics)

source: Wire-to-board ejector header connectors with locking design, available in 2.54mm, 2.0mm, and 1.27mm pitch. Durable and secure PCB connections.
es: Conectores tipo Ejector con seguro mecánico para conexiones de cable a placa. Compatibles con paso 2.54, 2.0 y 1.27mm.
fr: Connecteurs à éjection pour connexions fil-à-carte. Versions 2.54mm, 2.0mm et 1.27mm avec verrouillage. Idéal pour connecteurs IDC et circuits imprimés.
ja: ロック付きイジェクターヘッダー（Ejector Header）。2.54mm、2.0mm、1.27mmピッチに対応し、IDCケーブルとの接続に最適。
ko: 락킹 기능이 있는 이젝터 헤더 커넥터. 2.54mm, 2.0mm, 1.27mm 피치로 다양한 IDC 와이어 보드 연결에 적합합니다.
ru: Разъёмы Ejector Header с замком для соединений провод-плата. Шаг 2.54мм, 2.0мм и 1.27мм. Подходят для IDC шлейфов и стабильных соединений.
zh_hant: 提供牛角連接器（Ejector Header），支援2.54/2.0/1.27mm間距，搭配IDC排線使用，適合線對板穩定連接需求。

source: ejector header, wire to board, locking header, 2.54mm connector, shrouded header, Confull
es: conector ejector, conector con cierre, paso 2.54mm, cable a placa, conector IDC, Confull Electrónica
fr: connecteur à éjection, connecteur IDC, fil à carte, pas 2.54mm, connecteur verrouillable, Confull Électronique
ja: イジェクターヘッダー, ロック付きコネクタ, ピッチ2.54mm, ワイヤーボード接続, Confull エレクトロニクス
ko: 이젝터 헤더, 락킹 커넥터, 2.54mm 피치, 와이어 투 보드, IDC 커넥터, Confull 일렉트로닉스
ru: разъём ejector, разъём с замком, шаг 2.54мм, провод-плата, разъём IDC, Confull Электроникс
zh_hant: 帶鎖簡牛, 牛角連接器, Ejector Header, 線對板連接器, 2.54mm連接器, Confull Electronics

source: Ejector Header
es: Conector tipo Ejector
fr: Connecteur à éjection
ja: イジェクターヘッダー
ko: 이젝터 헤더 커넥터
ru: Разъём с фиксацией
zh_hant: 牛角連接器

source: IDC Connectors & Cable Assemblies | 2.54/2.0/1.27mm | Confull
es: Conectores IDC y Cables Planos | Paso 2.54/2.0/1.27mm | Confull
fr: Connecteurs IDC & nappes | Pas 2.54/2.0/1.27mm | Confull
ja: IDCコネクタ & フラットケーブル | 2.54/2.0/1.27mm | Confull
ko: IDC 커넥터 & 플랫 케이블 | 2.54/2.0/1.27mm | Confull
ru: IDC-разъёмы и плоские шлейфы | Шаг 2.54/2.0/1.27мм | Confull
zh_hant: IDC連接器與線束 | 2.54/2.0/1.27mm 間距 | 超越世紀電子(Confull Electronics)

source: Reliable IDC connectors and flat ribbon cable assemblies for 2.54mm, 2.0mm, and 1.27mm pitch. Ideal for wire-to-board applications.
es: Conectores IDC y conjuntos de cables planos compatibles con paso de 2.54mm, 2.0mm y 1.27mm. Perfectos para conexiones cable a placa.
fr: Connecteurs IDC et nappes de câbles plats pour connexions fil-à-carte. Compatibles avec pas de 2.54mm, 2.0mm et 1.27mm.
ja: 2.54mm・2.0mm・1.27mmピッチ対応のIDCコネクタとフラットケーブルアセンブリ。ワイヤー・ツー・ボード接続に最適。
ko: 2.54mm, 2.0mm, 1.27mm 피치의 IDC 커넥터와 플랫 케이블 조립품 제공. 와이어 투 보드 연결에 최적화된 솔루션.
ru: Разъёмы IDC и готовые кабельные сборки с шагом 2.54мм, 2.0мм и 1.27мм. Подходят для соединений провод–плата.
zh_hant: 專業IDC連接器與排線線束組裝，適用於2.54/2.0/1.27mm間距牛角連接器，常見於線對板應用場景。

source: IDC connector, ribbon cable, flat cable assembly, 2.54mm pitch, wire to board, Confull
es: conector IDC, cable plano, conjunto de cables, paso 2.54mm, cable a placa, Confull Electrónica
fr: connecteur IDC, nappe plate, câble plat, pas 2.54mm, connexion fil-carte, Confull Électronique
ja: idcコネクタ, フラットケーブル, フラットケーブル加工, ワイヤー接続, Confull エレクトロニクス
ko: IDC 커넥터, 플랫 케이블, 케이블 조립, 2.54mm 피치, 와이어 투 보드, Confull 일렉트로닉스
ru: разъём idc, плоский кабель, шлейф, шаг 2.54мм, провод-плата, Confull Электроникс
zh_hant: IDC連接器, 排線線束, 扁平電纜, 線對板連接器, 2.54mm接頭, Confull Electronics

source: IDC Connector & Cable
es: Conectores IDC y Cables Planos
fr: Connecteurs IDC & nappes
ja: DCコネクタ & フラットケーブル
ko: IDC 커넥터 & 플랫 케이블
ru: IDC-разъёмы и плоские шлейфы
zh_hant: IDC連接器與線束

source: Female Header Connector | 2.54/2.0/1.27mm | Confull
es: Conector hembra | Paso 2.54/2.0/1.27mm | Confull
fr: Connecteur femelle | Pas 2.54/2.0/1.27mm | Confull
ja: メスヘッダーコネクタ | 2.54/2.0/1.27mm ピッチ | Confull
ko: 암 헤더 커넥터 | 2.54/2.0/1.27mm 피치 | Confull
ru: Гнездовой разъём | Шаг 2.54/2.0/1.27мм | Confull
zh_hant: 排母連接器 | 2.54/2.0/1.27mm 間距 | 超越世紀電子(Confull Electronics)

source: Durable female header connectors with 2.54mm, 2.0mm, and 1.27mm pitch. Compatible with male headers for PCB stacking or wire-to-board.
es: Conectores hembra duraderos con paso de 2.54mm, 2.0mm y 1.27mm. Compatibles con pines macho para conexión de PCB.
fr: Connecteurs femelles de qualité avec pas de 2.54mm, 2.0mm et 1.27mm. Idéal pour connexions carte à carte ou câble à carte.
ja: 2.54mm、2.0mm、1.27mmピッチ対応のメスヘッダー。ピンヘッダーと組み合わせてPCBやワイヤーボード接続に最適。
ko: 2.54mm, 2.0mm, 1.27mm 피치의 암 헤더 커넥터. 수 헤더와 호환되어 PCB 또는 와이어 보드 연결에 적합합니다.
ru: Гнездовые разъёмы с шагом 2.54мм, 2.0мм, 1.27мм. Идеальны для соединения с штырьковыми разъёмами на платах.
zh_hant: 高品質排母連接器，支援2.54/2.0/1.27mm間距，常用於板對板或線對板連接，對應各種公針排針。

source: female header, 2.54mm connector, PCB header, board to board, shrouded socket, Confull
es: conector hembra, female header, paso 2.54mm, conector PCB, conector de pines, Confull Electrónica
fr: connecteur femelle, pin femelle, pas 2.54mm, connecteur PCB, connecteur empilable, Confull Électronique
ja: メスヘッダー, female header, ピッチ2.54mm, 基板用コネクタ, Confull エレクトロニクス
ko: 암 헤더, female header, 2.54mm 커넥터, PCB 커넥터, 핀 커넥터, Confull 일렉트로닉스
ru: гнездовой разъём, female header, шаг 2.54мм, разъём pcb, Confull Электроникс
zh_hant: 排母連接器, Female Header, 2.54mm排母, PCB接頭, 板對板連接器, Confull Electronics

source: Female Header
es: Conector hembra
fr: Connecteur femelle
ja: メスヘッダーコネクタ
ko: 암 헤더 커넥터
ru: Гнездовой разъём
zh_hant: 排母

source: Row
es: Fila
fr: Rangée
ja: 列数
ko: 열 (Yeol)
ru: Ряд (Ryad)
zh_hant: 排

source: IC Socket Connector | DIP 2.54/2.0/1.27mm | Confull
es: Zócalo IC DIP | Paso 2.54/2.0/1.27mm | Confull
fr: Support IC DIP | Pas 2.54/2.0/1.27mm | Confull
ja: ICソケット（DIP対応）| 2.54/2.0/1.27mm ピッチ | Confull
ko: IC 소켓 커넥터 | 2.54/2.0/1.27mm DIP | Confull
ru: Разъём для ИС DIP | Шаг 2.54/2.0/1.27мм | Confull
zh_hant: IC座連接器 | DIP 2.54/2.0/1.27mm 間距 | 超越世紀電子(Confull Electronics)

source: Durable IC socket connectors with 2.54mm, 2.0mm, 1.27mm pitch. Ideal for DIP IC installation, chip replacement, and PCB testing.
es: Zócalos para circuitos integrados DIP de paso 2.54mm, 2.0mm y 1.27mm. Solución ideal para instalación o prueba de chips.
fr: Support IC pour circuits intégrés DIP avec pas de 2.54mm, 2.0mm, 1.27mm. Idéal pour montage, remplacement ou test de puces.
ja: DIP IC用ICソケット。2.54mm、2.0mm、1.27mmピッチ対応。交換・テスト・実装に最適な高信頼コネクタ。
ko: DIP IC용 IC 소켓. 2.54mm, 2.0mm, 1.27mm 피치 지원. 칩 교체 및 회로 테스트에 최적화된 커넥터입니다.
ru: Гнездовые разъёмы для микросхем DIP с шагом 2.54мм, 2.0мм, 1.27мм. Идеально подходят для установки и тестирования ИС.
zh_hant: 供應支援2.54、2.0、1.27mm間距的IC座連接器，適用於DIP封裝IC安裝、測試與替換，品質穩定，可靠耐用。

source: IC socket, DIP socket, chip connector, 2.54mm pitch, PCB socket, Confull
es: zócalo IC, zócalo DIP, conector para chip, paso 2.54mm, conector PCB, Confull Electrónica
fr: support IC, support DIP, connecteur IC, pas 2.54mm, support puce, Confull Électronique
ja: ICソケット, DIPソケット, ピッチ2.54mm, チップソケット, Confull エレクトロニクス
ko: IC 소켓, DIP 소켓, 칩 커넥터, 2.54mm 피치, Confull 일렉트로닉스
ru: разъём IC, разъём DIP, панель для микросхем, шаг 2.54мм, Confull Электроникс
zh_hant: IC座, IC插座, DIP插座, 芯片插座, 2.54mm排腳, Confull Electronics

source: IC Socket
es: Zócalo IC DIP
fr: Support IC DIP
ja: ICソケット（DIP対応）
ko: IC 소켓 커넥터
ru: Разъём для ИС DIP
zh_hant: IC座連接器

source: Machined Round Female Header | Precision Socket | Confull
es: Zócalo redondo mecanizado | Conector hembra | Confull
fr: Connecteur femelle tourné | Précision IC Socket | Confull
ja: メス丸ピンソケット | 精密ICソケット | Confull
ko: 정밀 원형 암 커넥터 | IC 소켓 | Confull
ru: Панель с круглым гнездом | Токарный разъём IC | Confull
zh_hant: 圓孔排母連接器 | 車制IC插座 | 超越世紀電子(Confull Electronics)

source: High-precision machined round female headers for ICs and gold-plated pin insertion. Ideal for reliable board-to-board connections.
es: Conectores hembra mecanizados de alta precisión con contactos redondos. Ideal para pines dorados y conexiones IC confiables.
fr: Connecteurs femelles à contacts ronds usinés pour circuits imprimés. Solution fiable pour broches dorées et connexions précises.
ja: 高精度なメス丸ピンタイプソケット。2.54mm対応、ICや金メッキピンに最適な精密コネクタ。
ko: 2.54mm 피치 지원, 정밀 가공된 원형 핀 암 헤더. IC 삽입 및 고신뢰 보드 간 연결에 적합.
ru: Прецизионные разъёмы с круглыми гнёздами, подходят для монтажа ИС и контактов с позолоченными штырями.
zh_hant: 高精度車制圓孔排母，適用於IC插針對接，支援2.54mm等間距，導電穩定，耐插拔，適合板對板連接需求。

source: machined female header, round pin socket, precision IC socket, board-to-board, gold pin connector, Confull
es: zócalo redondo, conector hembra mecanizado, zócalo IC, contacto dorado, Confull Electrónica
fr: connecteur femelle tourné, support IC, socket de précision, broche ronde, Confull Électronique
ja: メスヘッダー, 丸ピンソケット, 精密ソケット, ICソケット, Confull エレクトロニクス
ko: 원형 암 커넥터, IC 소켓, 정밀 커넥터, 원형 핀, Confull 일렉트로닉스
ru: круглый разъём, гнездовой разъём, токарный сокет, ic панель, Confull Электроникс
zh_hant: 圓孔排母, 車制連接器, IC圓孔插座, Machined Header, Confull Electronics

source: Machined Female Header
es: Zócalo redondo mecanizado
fr: Connecteur femelle tourné
ja: メス丸ピンソケット
ko: 정밀 원형 암 커넥터
ru: Панель с круглым гнездом
zh_hant: 圓孔排母

source: Machined Round Pin Header | Precision Connector | Confull
es: Pin Header Redondo Mecanizado | Paso 2.54/2.0/1.27mm | Confull
fr: Broche ronde usinée | Connecteur 2.54/2.0/1.27mm | Confull
ja: 丸ピンヘッダー | 精密コネクタ 2.54/2.0/1.27mm | Confull
ko: 정밀 원형 핀 헤더 | 2.54/2.0/1.27mm | Confull
ru: Разъём с круглыми штырями | 2.54/2.0/1.27мм | Confull
zh_hant: 圓孔排針連接器 | 車制精密插針 | 超越世紀電子(Confull Electronics)

source: High-precision machined round pin headers for reliable PCB connections. Supports 2.54mm, 2.0mm, and 1.27mm pitch. Durable gold-plated design.
es: Conectores pin header de pines redondos mecanizados, ideales para conexiones fiables en PCB. Compatible con paso 2.54mm, 2.0mm, 1.27mm.
fr: Connecteurs à broches rondes usinées pour circuits imprimés. Précision, fiabilité et compatibilité avec pas 2.54mm, 2.0mm, 1.27mm.
ja: 精密加工された丸ピンヘッダー。2.54mm、2.0mm、1.27mmピッチに対応し、耐久性と高接触性を実現。
ko: 2.54mm, 2.0mm, 1.27mm 피치 지원의 정밀 가공 원형 핀 헤더. 신뢰성 높은 PCB 연결용 커넥터.
ru: Прецизионные разъёмы с круглыми контактами (machined pin header) для надёжных соединений на плате. Поддержка 2.54мм, 2.0мм, 1.27мм.
zh_hant: 支援2.54/2.0/1.27mm間距的圓孔排針，精密加工、導電穩定，適用於板對板或模組插拔應用。

source: machined pin header, round pin, precision header, 2.54mm pitch, gold plated pin, Confull
es: pin header redondo, pines mecanizados, paso 2.54mm, conector precisión, Confull Electrónica
fr: broche usinée, pin header rond, connecteur précision, pas 2.54mm, Confull Électronique
ja: 丸ピンヘッダー, 精密ピンヘッダー, 2.54mmピッチ, 車製ピン, Confull エレクトロニクス
ko: 원형 핀 헤더, 정밀 핀, machined 커넥터, 2.54mm 핀, Confull 일렉트로닉스
ru: круглый пин, machined разъём, штыревой разъём, шаг 2.54мм, Confull Электроникс
zh_hant: 圓孔排針, 車制排針, Machined Header, 精密連接器, 插針模組, Confull Electronics

source: Machined Pin Header
es: Pin Header Redondo Mecanizado
fr: Broche ronde usinée
ja: 丸ピンヘッダー
ko: 정밀 원형 핀 헤더
ru: Разъём с круглыми штырями
zh_hant: 圓孔排針

source: Learn About Connectors | Product Guide & Types | Confull
es: Conozca nuestros conectores | Tipos y usos | Confull
fr: Guide des connecteurs | Types & applications | Confull
ja: 製品ガイド | コネクタの種類と用途 | Confull
ko: 커넥터 제품 안내 | 종류 및 적용 가이드 | Confull
ru: Изучите продукцию | Типы разъёмов | Confull
zh_hant: 認識連接器產品 | 類型與應用指南 | 超越世紀電子(Confull Electronics)

source: Explore Confull connector types, features, and applications. Learn how to choose the right pin headers, sockets, and wire-to-board connectors.
es: Aprenda sobre conectores: encabezados, zócalos, IDC, wire-to-board y más. Guía completa de productos y aplicaciones de Confull.
fr: Découvrez les types de connecteurs, leurs caractéristiques et domaines d’usage. Un guide pratique pour comprendre les produits Confull.
ja: コネクタの基礎を学ぶページ。ピンヘッダー、ソケット、IDC、ワイヤー・ツー・ボード等の種類と活用法を紹介。
ko: Confull 커넥터 종류별 특징과 활용 분야 소개. 핀 헤더, 소켓, IDC, 와이어 투 보드 연결까지 한눈에 파악.
ru: Руководство по типам и применению разъёмов: штыревые, гнездовые, IDC, подключения провод–плата и другое.
zh_hant: 系統說明排針、排母、牛角、簡牛、IDC線等連接器的特性與應用，幫助選擇最合適的解決方案。

source: connector types, product guide, pin headers, sockets, wire-to-board, Confull
es: tipos de conectores, guía de productos, header, IDC, conexiones PCB, Confull Electrónica
fr: types de connecteurs, guide produit, broches, connecteur IDC, Confull Électronique
ja: コネクタ種類, 製品知識, ピンヘッダー, IDC, 基板接続, Confull エレクトロニクス
ko: 커넥터 종류, 제품 안내, 핀 헤더, IDC, PCB 연결, Confull 일렉트로닉스
ru: типы разъёмов, руководство, штырьки, IDC разъёмы, Confull Электроникс
zh_hant: 連接器種類, 產品學習, 排針排母, 應用介紹, 線對板連接, Confull Electronics

source: Learn Products
es: Conozca nuestros conectores
fr: Guide des connecteurs
ja: 製品ガイド
ko: 커넥터 제품 안내
ru: Изучите продукцию
zh_hant: 認識連接器產品

source: Jumper Cap | 5.08/2.54/2.0/1.27mm Pitch | Confull
es: Jumper de Cortocircuito | Paso 5.08/2.54/2.0/1.27mm | Confull
fr: Cavalier Jumper | Pas 5.08/2.54/2.0/1.27mm | Confull
ja: ジャンパーキャップ | 5.08/2.54/2.0/1.27mm ピッチ | Confull
ko: 점퍼 쇼트캡 | 5.08/2.54/2.0/1.27mm 피치 | Confull
ru: Джампер-перемычка | Шаг 5.08/2.54/2.0/1.27мм | Confull
zh_hant: 短路帽 | 5.08/2.54/2.0/1.27mm 間距 | 超越世紀電子(Confull Electronics)

source: High-quality jumper caps for 5.08mm, 2.54mm, 2.0mm, 1.27mm headers. Ideal for PCB shorting, pin setting, and circuit testing.
es: Jumpers para pines de paso 5.08mm, 2.54mm, 2.0mm y 1.27mm. Perfectos para cortocircuitos, configuración de placas y pruebas eléctricas.
fr: Cavaliers de court-circuit compatibles avec les broches 5.08, 2.54, 2.0 et 1.27mm. Idéal pour le paramétrage, test et shunt de circuits imprimés.
ja: 5.08〜1.27mmピッチに対応するジャンパーキャップ。基板設定、ピンショート、テスト用に最適。安定した接触性能。
ko: 5.08mm, 2.54mm, 2.0mm, 1.27mm 핀 간격에 맞는 점퍼 캡. 보드 설정, 회로 단락, 테스트에 최적.
ru: Перемычки для штырей с шагом 5.08/2.54/2.0/1.27мм. Подходят для настройки, тестирования и замыкания на печатных платах.
zh_hant: 短路帽支援5.08、2.54、2.0、1.27mm排針，常用於跳線設置、短接功能與主機板測試，導通穩定、插拔便利。

source: jumper cap, shunt cap, 2.54mm jumper, 1.27mm pitch, PCB shorting, Confull
es: jumper, puente, jumper PCB, paso 2.54mm, conector de shunt, Confull
fr: cavalier, jumper, shunt PCB, pas 2.54mm, cavalier de configuration, Confull
ja: ジャンパー, ショートキャップ, ピッチ2.54mm, PCB用ジャンパー, Confull エレクトロニクス
ko: 점퍼, 쇼트캡, 2.54mm 점퍼, PCB 연결, 점퍼 커넥터, Confull 일렉트로닉스
ru: перемычка, джампер, шаг 2.54мм, шунт, jumper для PCB, Confull
zh_hant: 短路帽, 跳帽, Jumper帽, PCB短接帽, 2.54mm跳線, Confull Electronics

source: Pin Header Jumper
es: Jumper de Cortocircuito
fr: Cavalier Jumper
ja: ジャンパーキャップ
ko: 점퍼 쇼트캡
ru: Джампер-перемычка
zh_hant: 短路帽

source: Pin Header Connector | 5.08/2.54/2.0/1.27/1.0mm Pitch | Confull
es: Conector de pines | Paso 5.08/2.54/2.0/1.27/1.0mm | Confull
fr: Connecteur à broches | Pas 5.08/2.54/2.0/1.27/1.0mm | Confull
ja: ピンヘッダーコネクタ | 5.08/2.54/2.0/1.27/1.0mm ピッチ | Confull
ko: 핀 헤더 커넥터 | 5.08/2.54/2.0/1.27/1.0mm 피치 | Confull
ru: Штыревой разъём | Шаг 5.08/2.54/2.0/1.27/1.0мм | Confull
zh_hant: 排針連接器 | 5.08/2.54/2.0/1.27/1.0mm 間距 | 超越世紀電子(Confull Electronics)

source: High-quality pin headers for 5.08mm, 2.54mm, 2.0mm, 1.27mm, 1.0mm pitch. Ideal for PCB connections and board-to-board interfaces.
es: Conectores tipo pin header con paso de 5.08mm, 2.54mm, 2.0mm, 1.27mm y 1.0mm. Uso en PCB, módulos y conexiones múltiples.
fr: Connecteurs à broches mâles disponibles en pas de 5.08mm à 1.0mm. Solution idéale pour cartes électroniques et connexions empilées.
ja: 5.08～1.0mmピッチに対応するピンヘッダー。基板接続、モジュール間の信号伝送に最適。カスタム仕様可能。
ko: 5.08mm~1.0mm 피치의 핀 헤더 제공. PCB 연결 및 보드 간 모듈 확장에 적합하며 고객 맞춤형 가능.
ru: Штыревые разъёмы для печатных плат с шагом 5.08мм до 1.0мм. Подходят для модульных и межплатных соединений.
zh_hant: 專業提供5.08、2.54、2.0、1.27、1.0mm排針，適用於PCB對接與模組連接，支援客製化針腳排數。

source: pin header, 2.54mm connector, PCB header, 1.27mm pitch, 5.08mm pin, Confull
es: conector de pines, pin header, paso 2.54mm, conector PCB, Confull Electrónica
fr: connecteur à broches, pin header, pas 2.54mm, connecteur PCB, Confull Électronique
ja: ピンヘッダー, 2.54mmコネクタ, 基板用ピン, 1.27mmピッチ, Confull エレクトロニクス
ko: 핀 헤더, pin header, 2.54mm 커넥터, pcb 연결, 커넥터 모듈, Confull 일렉트로닉스
ru: штыревой разъём, pin header, шаг 2.54мм, разъём pcb, Confull Электроникс
zh_hant: 排針, 插針連接器, 2.54mm間距, 1.27mm排針, PCB排針, Confull Electronics

source: Pin Header
es: Conector de pines
fr: Connecteur à broches
ja: ピンヘッダーコネクタ
ko: 핀 헤더 커넥터
ru: Штыревой разъём
zh_hant: 排針

source: Menu
es: Menú
ja: メニュー
ko: 메뉴
ru: Меню
zh_hant: 選單

source: Contact Us
es: Contáctenos
fr: Contactez-nous
ja: お問い合わせ
ko: 문의하기
ru: Связаться с нами
zh_hant: 聯絡我們

source: Address:
es: Dirección:
fr: Adresse :
ja: 住所：
zh_hant: 地址：

source: Building B10, Hengfeng Industrial City, Baoan District, Shenzhen, 518100
es: Edificio B10, Ciudad Industrial Hengfeng, Distrito Baoan, Shenzhen, 518100
fr: Bâtiment B10, Hengfeng Industrial City, district de Bao'an, Shenzhen, 518100
ja: 中国広東省深圳市宝安区恒豊工業城B10棟、郵便番号 518100
zh_hant: 中國深圳市寶安區恆豐工業城 B10 棟，郵遞區號 518100

source: Email:
es: Correo electrónico:
ja: メールアドレス：
zh_hant: 電子信箱：

source: Contact Us | Confull Electronics - Connector Manufacturer in China
es: Contáctenos | Confull Electrónica – Fabricante de conectores en China
fr: Contactez-nous | Confull Électronique – Fabricant de connecteurs
ja: お問い合わせ | Confull エレクトロニクス – コネクタメーカー（中国）
zh_hant: 聯絡我們 | 超越世紀電子(Confull Electronics) – 中國連接器製造商

source: Get in touch with Confull Electronics, your trusted connector supplier in China. We respond quickly to inquiries and support requests.
es: Comuníquese con Confull Electrónica para cotizaciones o soporte técnico de conectores. Respondemos rápidamente a su solicitud.
fr: Contactez Confull Électronique pour vos besoins en connecteurs. Réponse rapide à toute demande d'information ou de devis.
ja: 中国の信頼できるコネクタメーカーConfullにお問い合わせください。迅速にお見積もり・ご質問に対応いたします。
zh_hant: 聯絡 Confull Electronics（超越世紀電子），提供快速的產品諮詢與技術支援服務。

source: contact Confull, connector supplier China, connector manufacturer, get a quote, electronics support
es: contáctenos, fabricante de conectores, proveedor de conectores, solicitar cotización, Confull
fr: contact, fabricant de connecteurs, fournisseur de connecteurs, devis connecteur, Confull
ja: お問い合わせ, コネクタメーカー, お見積り, 技術サポート, Confull エレクトロニクス
zh_hant: 聯絡我們, 連接器製造商, 連接器供應商, 索取報價, Confull Electronics

source: Contact Us - Confull Electronics
es: Contáctenos – Confull Electrónica
fr: Contactez-nous – Confull Électronique
ja: お問い合わせ - Confull エレクトロニクス
zh_hant: 聯絡我們 - 超越世紀電子(Confull Electronics)

source: Phone:
es: Teléfono:
fr: Téléphone:
ja: 電話（でんわ）:
zh_hant: 電話：

source: WeChat:
zh_hant: 微信：

source: Jay Lyu
zh_hant: 吕先生

source: Jenny Zhang
zh_hant: 张女士

source: Confull Electronics | Professional Connector Manufacturer in China
es: Confull Electrónica | Fabricante de conectores en China
fr: Confull Électronique | Fabricant de connecteurs en Chine
ja: Confull エレクトロニクス | 中国のコネクタメーカー
zh_hant: 超越世紀電子(Confull Electronics) | 專業連接器製造商

source: Confull Electronics is a leading connector manufacturer in China. We provide high-quality pin headers, sockets, IDC, wire-to-board connectors and more.
es: Confull Electrónica ofrece conectores de alta calidad como headers, IDC y soluciones PCB. Fabricación profesional y entrega internacional.
fr: Confull Électronique est un fabricant chinois de connecteurs de qualité : headers, IDC, connecteurs PCB, etc. Service personnalisé et fiable.
ja: Confullは中国の専門コネクタメーカーです。ピンヘッダー、IDC、PCB接続部品など多様な製品を提供しています。
zh_hant: 超越世紀電子為中國領先的連接器供應商，產品包含排針排母、IDC、牛角、線對板等，支援客製與批量出貨。
